## hw_3_2

In [2]:
import pandas as pd

# 데이터 로드
file_path = pd.read_csv('data/group_data.csv')
data = file_path.copy()
data

   category      value
0         C  23.692333
1         D  20.856841
2         A  19.421759
3         C  18.494482
4         C  12.607390
..      ...        ...
95        B  27.749672
96        B  16.083734
97        D  18.389692
98        B  24.067586
99        A  13.845678

[100 rows x 2 columns]

In [5]:
# 특정 조건을 만족하는 데이터 필터링
# and를 사용하면 오류 발생 => & 사용해야 함
filtered_data = data.loc[(data['value']>=10) & (data['value']<=20)]
print(f'조건에 맞는 데이터의 개수: {len(filtered_data)}')
filtered_data.head()

조건에 맞는 데이터의 개수: 51

  category      value
2        A  19.421759
3        C  18.494482
4        C  12.607390
5        D  16.400779
6        A  17.696806

In [7]:
# 특정 열을 기준으로 그룹화하고, 그룹별 평균값 계산
grouped_mean = filtered_data.groupby('category')['value'].mean()
grouped_mean

category
A    17.784972
B    16.065752
C    16.299848
D    16.249271
Name: value, dtype: float64

In [4]:
# 평균값을 내림차순으로 정렬하여 출력
sorted_grouped_mean = grouped_mean.sort_values(ascending=False)
sorted_grouped_mean

category
A    17.784972
C    16.299848
D    16.249271
B    16.065752
Name: value, dtype: float64

## hw_3_4

In [8]:
# 1. 필요한 라이브러리
# - pandas는 데이터 불러오기 및 전처리를 위해 필요합니다.
# - scipy.stats의 ttest_ind는 두 그룹의 평균을 비교하는 독립표본 t-검정을 수행하는 함수입니다.

import pandas as pd
from scipy.stats import ttest_ind

# 2. CSV 파일을 불러오세요.
# - 파일 경로: "../data/time_series_data.csv"
# - 데이터를 불러와 `df_ts`라는 변수에 저장하세요.

df_ts = pd.read_csv('data/time_series_data.csv')
df_ts

           Date      value
0    2023-01-01  52.274599
1    2023-01-02  63.071428
2    2023-01-03  33.925168
3    2023-01-04  51.846339
4    2023-01-05  52.598828
..          ...        ...
360  2023-12-27  59.261775
361  2023-12-28  69.094166
362  2023-12-29  36.014324
363  2023-12-30  55.629692
364  2023-12-31  43.493574

[365 rows x 2 columns]

In [9]:
df_ts.dtypes

Date      object
value    float64
dtype: object

In [10]:
# 3. 날짜 데이터를 datetime 형식으로 변환하세요.
# - "Date" 컬럼을 문자열이 아닌 날짜 형식으로 변환해야 이후 분석이 가능함.
df_ts["Date"] = pd.to_datetime(df_ts['Date'])
df_ts.dtypes

Date     datetime64[ns]
value           float64
dtype: object

In [11]:
# 4. 데이터를 날짜 기준으로 정렬하세요.
# - 만약 데이터가 섞여 있다면 시간 순서대로 정렬해야 합니다.
df_ts = df_ts.sort_values(by='Date')
df_ts

          Date      value
0   2023-01-01  52.274599
1   2023-01-02  63.071428
2   2023-01-03  33.925168
3   2023-01-04  51.846339
4   2023-01-05  52.598828
..         ...        ...
360 2023-12-27  59.261775
361 2023-12-28  69.094166
362 2023-12-29  36.014324
363 2023-12-30  55.629692
364 2023-12-31  43.493574

[365 rows x 2 columns]

In [13]:
# 5. 전체 데이터의 기본 통계량을 확인하세요.
# - describe() 함수를 사용하여 데이터의 평균, 표준편차, 최소/최대값 등을 확인할 수 있음.
summary_stats = df_ts[["value"]].describe()

# 6. 기본 통계량을 출력하세요.
print("전체 데이터의 기본 통계량")
summary_stats

전체 데이터의 기본 통계량

            value
count  365.000000
mean    50.452941
std      9.976651
min     17.587327
25%     42.923305
50%     50.642800
75%     56.795977
max     88.527315

In [15]:
# 7. 특정 기간(1월 vs. 12월) 비교를 위해 "Month" 컬럼을 추가하세요.
# - datetime 형식의 데이터를 활용하여 "Month" 컬럼을 생성.
df_ts["Month"] = df_ts["Date"].dt.month
df_ts

          Date      value  Month
0   2023-01-01  52.274599      1
1   2023-01-02  63.071428      1
2   2023-01-03  33.925168      1
3   2023-01-04  51.846339      1
4   2023-01-05  52.598828      1
..         ...        ...    ...
360 2023-12-27  59.261775     12
361 2023-12-28  69.094166     12
362 2023-12-29  36.014324     12
363 2023-12-30  55.629692     12
364 2023-12-31  43.493574     12

[365 rows x 3 columns]

In [18]:

# 8. 1월과 12월 데이터를 각각 선택하세요.
# - 1월 데이터를 `jan_values` 변수에 저장
jan_values = df_ts[df_ts["Month"] == 1]["value"]
jan_values

0     52.274599
1     63.071428
2     33.925168
3     51.846339
4     52.598828
5     57.818229
6     37.630493
7     36.795434
8     55.219416
9     52.969847
10    52.504929
11    53.464482
12    43.199753
13    52.322537
14    52.930725
15    42.856486
16    68.657745
17    54.738329
18    38.086965
19    56.565536
20    40.253183
21    57.870846
22    61.585956
23    41.793177
24    59.633761
25    54.127809
26    58.220602
27    68.967930
28    47.546119
29    42.462638
30    41.104856
Name: value, dtype: float64

In [20]:
# - 12월 데이터를 `dec_values` 변수에 저장
dec_values = df_ts[df_ts["Month"] == 12]["value"]
dec_values

334    66.449677
335    47.509640
336    55.765570
337    53.112502
338    80.788808
339    61.195749
340    48.720824
341    40.444596
342    33.935537
343    52.034636
344    42.436493
345    35.777463
346    43.534271
347    39.184520
348    66.871416
349    58.816398
350    49.920274
351    64.799441
352    50.773683
353    41.387158
354    65.231241
355    55.389100
356    39.627538
357    48.096613
358    41.243817
359    36.172003
360    59.261775
361    69.094166
362    36.014324
363    55.629692
364    43.493574
Name: value, dtype: float64

In [22]:

# 9. 1월과 12월의 평균 값을 계산하세요.
# - mean() 함수를 사용하여 평균을 계산.
jan_mean = jan_values.mean()
dec_mean = dec_values.mean()

# 10. 1월과 12월의 평균을 출력하세요.
print("\n1월과 12월의 평균 비교")
print(f"1월 평균: {jan_mean:.2f}")
print(f"12월 평균: {dec_mean:.2f}")

1월과 12월의 평균 비교
1월 평균: 51.07
12월 평균: 51.06

In [ ]:
# 11. 독립표본 t-검정을 수행하세요.
# - 귀무가설(H₀): "1월과 12월의 값에 유의미한 차이가 없다"
# - 대립가설(H₁): "1월과 12월의 값에 유의미한 차이가 있다"

# t-검정은 두 집단(여기서는 1월과 12월)의 평균이 통계적으로 차이가 있는지를 확인하는 방법입니다.
# 'equal_var=False'는 두 집단이 동일한 분산을 가진다고 가정하지 않고 계산하겠다는 의미입니다.
# jan_values와 dec_values는 각각 1월과 12월의 데이터 값 목록(리스트 또는 배열)입니다.

t_stat, p_value = ttest_ind(jan_values, dec_values, equal_var=False)

# 12. t-검정 결과를 출력하세요.
print("\n독립표본 t-검정 결과")  # 결과 출력 제목
print(f"t-값: {t_stat:.4f}")      # t-값: 두 집단 간 차이를 수치로 나타낸 값 (크면 클수록 차이가 크다는 뜻)
print(f"p-value: {p_value:.4f}")  # p-value: 차이가 우연히 발생했을 확률
                                  # 일반적으로 p-value가 0.05보다 작으면 유의미한 차이가 있다고 판단합니다.

독립표본 t-검정 결과
t-값: 0.0040
p-value: 0.9968

In [23]:
# 13. 결과 해석을 추가하세요.
# - p-value가 0.05보다 작으면 통계적으로 유의미한 차이가 있다고 판단.
# - p-value가 0.05보다 크면 차이가 없다고 판단.
if p_value < 0.05:
    print("1월과 12월의 값이 통계적으로 유의미한 차이가 있습니다!")
else:
    print("1월과 12월의 값에 통계적으로 유의미한 차이가 없습니다.")
    print("연초와 연말의 값이 비슷한 패턴을 보입니다.")

1월과 12월의 값에 통계적으로 유의미한 차이가 없습니다.
연초와 연말의 값이 비슷한 패턴을 보입니다.